constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        physicalType    patch;
        nFaces          132;
        startFace       183;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          5;
        startFace       315;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          5;
        startFace       320;
    }
    right
    {
        type            patch;
        physicalType    patch;
        nFaces          132;
        startFace       325;
    }
    wall
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       457;
    }
)

// ************************************************************************* //
